{
  "topbio": {
    "pic": "assets/images/avatar.jpg",
    "fullname": "Vlad Feninets",
    "title": "front-end engineer",
    "links": [
      {
        "name": "LinkedIn",
        "targetBlank": true,
        "href": "https://www.linkedin.com/in/fnnzzz/",
        "val": "https://linkedin.com/in/fnnzzz"
      },
      {
        "name": "GitHub",
        "targetBlank": true,
        "href": "https://github.com/fnnzzz/",
        "val": "https://github.com/fnnzzz"
      },
      {
        "name": "Email",
        "href": "mailto:v.feninets@gmail.com",
        "val": "v.feninets@gmail.com"
      },
      {
        "name": "Telegram",
        "targetBlank": true,
        "href": "https://telegram.me/fnnzzz",
        "val": "@fnnzzz"
      }
    ]
  },
  "general-info": {
    "blockname": "General Info",
    "city": {
      "key": "🏙️",
      "val": "Vienna, Austria 🇦🇹"
    },
    "date-of-birth": { "key": "🎂", "val": "10 Nov 1994 🇺🇦" },
    "english": { "key": "🇬🇧", "val": "B2" },
    "education": {
      "key": "🎓",
      "val": "Computer engineering, bachelor degree [2012 - 2016]"
    }
  },
  "summary": {
    "blockname": "Summary",
    "paragraphs": [
      "As a Senior Front End Engineer with {{OVERALL_EXPERIENCE_YEARS}} years of diverse experience, I've overseen projects spanning a multitude of domains, from implementing serverless solutions using Lambda/Dynamo/SQS to configuring Linux servers for LAMP stacks.",
      "As a Frontend Tech Lead, I successfully tackled numerous technical challenges, adapting tools like Webpack and PostCSS to implement advanced performance optimizations. I implemented techniques such as TypeScript strict mode, introduced static analysis with Sonar, and integrated real-time error monitoring to minimize human errors. It allowed to enhance overall product quality.",
      "Additionally, I improved project builds, doubling their speed by introducing <a href='https://nx.dev/concepts/more-concepts/incremental-builds' target='_blank' rel='noopener noreferrer'>incremental builds</a> and transitioning our CI from Teamcity to GitHub Actions to allow parallelize the process. Simultaneously, I played a pivotal role in team growth, contributing to the expansion from 6 to 12 frontend engineers by actively participating in the hiring process as an interviewer.",
      "Continually broadening my skills as a T-Shaped engineer, I aim for roles like System Architect or CTO. In the past year, I've explored AWS Cloud, methodically expanding expertise and earning certifications (<a href='https://www.credly.com/badges/4986f3f5-3985-4467-9124-e18d26c59404/public_url' target='_blank' rel='noopener noreferrer'>#1</a>, <a href='https://www.credly.com/badges/6e1a5df7-bbae-46e6-952b-984757a5e337/public_url' target='_blank' rel='noopener noreferrer'>#2</a>). This empowers me to drive projects from inception to success, aligning with my passion for Smart Home. Cloud solutions simplify the automation of various aspects of my home most effectively, from practical tasks to own projects like real-time <a href='https://d1vlvmzdvhw8b.cloudfront.net/' target='_blank' rel='noopener noreferrer'>bus arrival cards</a>. I've also implemented microservices architectures for projects, contributing to their technological foundations."
    ]
  },
  "skills": {
    "blockname": "Skills",
    "list": [
      {
        "name": "Lead skills",
        "descr": "In the tech lead position I did:<br><ul class='inner-list'><li>mentoring engineers</li> <li>one-to-one sessions</li> <li>code review</li> <li>architecture design sessions</li> <li>troubleshooting and helping</li> <li>interviews (recruitment)</li> <li>implemented a bonus system</li></ul>"
      },
      {
        "name": "AWS Cloud",
        "descr": "Recently I started to study AWS cloud more comprehensively.<br/>Before, I often used different clouds for solving applied problems - like GCP, Azure, AWS. But now I focused and stopped on AWS cloud.<br/>I often use services like Lambda, DynamoDB, EC2/Fargate to automate some stuff, for my purposes and just for experimenting.<br/><a href='https://www.credly.com/badges/99489466-96d8-4dbc-9bab-a152d48aa692/public_url' target='_blank' rel='noopener noreferrer'>I already have</a> a \"Cloud Practitioner\" certificate, and now I'm preparing to get associate level <a href='https://aws.amazon.com/certification/' target='_blank' rel='noopener noreferrer'>cerificates</a> - `Developer` and `Solutions Architect`.",
        "badges": [
          { "pic": "assets/images/cpf-badge.png", "url": "https://www.credly.com/badges/99489466-96d8-4dbc-9bab-a152d48aa692/public_url" },
          { "pic": "assets/images/developer-associate.png", "url": "https://www.credly.com/badges/4986f3f5-3985-4467-9124-e18d26c59404/public_url" },
          { "pic": "assets/images/solutions-arch-associate.png" }
        ]
      },
      {
        "name": "JavaScript/TypeScript",
        "descr": "<ul class='inner-list'><li>Understands intricacies like differences between `call` and `apply` methods and potential pitfalls of `.sort()`.</li><li>Implements polyfills and innovative methods like `.any()` for promises.</li><li>Familiar with the event loop and keen on Functional Reactive Programming (FRP).</li><li>Advocates for strictly typed code in Angular.</li><li>Expert in TypeScript, utilizing generics, type guards, and conditional types.</li><li>Applies advanced TypeScript tricks, such as type inference, for innovative solutions.</li></ul>"
      },
      {
        "name": "RxJS",
        "descr": "When you come to RxJS - your mind is blown. <br/>But after that, you can't imagine a better tool to organize async stuff. <br/>I know the difference between `switchMap` and `mergeMap`, when to use cold observables instead of hot (or vice versa), and how `shareReplay()` will help you with this."
      },
      {
        "name": "Angular",
        "descr": "I've been working with Angular for 4 years. A lot of time I've been involved in performance issues in angular, so I know how to tame `zone.js` or turn it off at all (but it's more complicated). <br/>I know why exists `@Inject` and `@SkipSelf` and I've implemented own modules with `forRoot(...)`<br/>Very much looking forward to v14 with strictly typed forms and optional modules (SCAM-like). <br/>Angular stands out with its DI/IoC, it's a very powerful tool."
      },
      {
        "name": "React",
        "descr": "Currently, my main framework. We use the standard setup - hooks and redux."
      },
      {
        "name": "HTML5 + CSS3 + SVG",
        "descr": "div[style*=\"height: 70px\"] { height: 40px !important; }"
      },
      {
        "name": "Linux",
        "descr": "I know how to use grep, I can write a simple bash script, I can monitor an instance via top/htop"
      },
      {
        "name": "Node.js",
        "descr": "I have experience with koa+mongoose in my own pet project. <br>I also often inspect some bundler's stuff in node_modules to demystifying how it works. <br>Very often used node for different utility purposes, like iterating, creating and modifying files, some kind of generators, some global refactoring (<a href='https://github.com/dsherret/ts-morph' target='_blank' rel='noopener noreferrer'>ts-morph</a>), stuff improved DX, etc. <br>Node often is very useful"
      },
      {
        "name": "GraphQL/Apollo",
        "descr": "Used graphql federation with apollo-client on a front-end as a primary BFF in robota.ua"
      },
      {
        "name": "SASS/postcss/tailwindcss",
        "descr": "tailwind is my favorite one."
      },
      {
        "name": "Docker",
        "descr": "Often use for work and/or personal purposes."
      },
      {
        "name": "k8s",
        "descr": "I know general concepts of k8s, but in practice used rarely."
      },
      {
        "name": "CI/CD",
        "descr": "Had experience with transferring CI of our frontend from TeamCity to <br/>Github Actions and set up then (very interesting activity to the honest)."
      },
      {
        "name": "MySQL",
        "descr": "I had experience with MySQL during my students' years.<br>I've developed a structure of DB as a part of my <a href=\"https://fnnzzz.github.io/diploma-presentation/\" target=\"_blank\"> diploma work</a>"
      },
      {
        "name": "NoSQL",
        "descr": "I have pet projects that used MongoDB (with koa and mongoose)"
      }
    ]
  },
  "work-experience": {
    "blockname": "Work Experience",
    "list": [
      {
        "name": "Senior Front-end engineer: <img class='company-logo' src='assets/images/xbo-logo.webp' /><a href='https://xbo.com/web-trader' target='_blank' rel='noopener noreferrer'>xbo.com</a>",
        "start": "04/2022",
        "descr": "Contributed to the development of XBO.com's crypto-trading platform.<br/>It significantly enriched my understanding of the crypto world and trading in its entirety.<br/><br/>The product demanded extensive real-time updates through websockets for the majority of its features, requiring updates every second for charts, trends, and more. This led to dealing with various performance intricacies, prompting optimization efforts. Additionally, the platform involved the integration of complex reactive forms with calculations and mathematics on the front end. We also encountered and solved precision issues with floating-point numbers in JavaScript, a crucial consideration for maintaining accuracy in financial data.<br/><br/>The development stack used for this solution was quite simple and popular:<br/>React, Redux, SignalR and a little bit of RxJS."
      },
      {
        "name": "Front-end + DevOps engineer: ducky.app",
        "start": "12/2021",
        "end": "04/2022",
        "descr": "Drove frontend development of Ducky.app, a groundbreaking startup dedicated to streamlining benefits management for companies and reducing costs through an innovative concept known as the \"Benefits Cafeteria\".<br/><br/>I collaborated with an exceptional team of experts, where each member was a rock star, showcasing strong soft skills and a high level of tech expertise. Despite our small size (10 members), we excelled in asynchronous communication and maintained well-defined processes, cultivating a productive work atmosphere.<br/><br/>Taking the lead in front-end development independently, my focus was on the rapid creation of the product, essential for a startup's pace, while ensuring a future-proof architecture. Additionally, I played a role in the DevOps domain, assisting with tasks like CI/CD and automating processes. We opted for Angular paired with Tailwind (as a design system). This deliberate choice in our technology stack accelerated the development pace.<br/><br/>Regrettably, despite our efforts, the product could not be delivered to customers due to financial issues. But overall, it was an exceptional experience with good teamwork vibes and efficient processes. The development journey was truly enjoyable."
      },
      {
        "name": "Front-end Tech Lead: <img class='company-logo' src='assets/images/robota-logo.png' /><a href='https://robota.ua' target='_blank' rel='noopener noreferrer'>robota.ua</a>",
        "start": "01/2021",
        "end": "12/2021",
        "descr": "In this role, I've focused on complex problems (either from business or engineers) which were sometimes complicated and didn't have easy answers. So many of them I had to analyze and research. A few such problems and solutions: <br> <br>  <ul>     <li>         <strong>Problem:</strong> We can't ship features fast. CI (TeamCity) accumulates a queue, a build has taken a lot of time.         <br/><strong>Solution:</strong> I've proposed and realized to migrate from TeamCity to Github Actions, then we've switched to <a href='https://nx.dev/ci/incremental-builds' target='_blank' rel='noopener noreferrer'>incremental builds approach</a> which significantly accelerated the speed of building our frontend mono repository (<a href='https://nx.dev/documentation/shared/incremental-build-webpack-vs-incremental.png' target='_blank' rel='noopener noreferrer'>pic</a> describing why)     </li>         <br> <li>         <strong>Problem:</strong> Sometimes we had errors like `undefined is not a...`.         <br/><strong>Solution:</strong> We've enabled typescript strict mode (incremental builds approach allowed us to make an iterative transition enabling for all new libs and slowly turning on for older ones.). Additionally, we improved ESLint (switched to full configs, added new plugins and more).     </li>   <br>     <li>         <strong>Problem:</strong> Sometimes pages load and render slowly. Lighthouse shows up metrics in a red zone.         <br/><strong>Solution:</strong> Decrease influence of zone.js (partial disable), inspect problems and \"slow code\" via chrome dev tools (perf tab). Enabling speed-ups in Cloudflare. As a result, we got into the green zone on some pages.     </li>  </ul>  <br>Aside from the technical stuff I've mentored, troubleshot, had sessions dedicated to architecture, one-on-one sessions, interviews (recruitment). We managed to launch a bonus program for engineers 💰"
      },
      {
        "name": "Front-end engineer: <img class='company-logo' src='assets/images/robota-logo.png' /><a href='https://robota.ua' target='_blank' rel='noopener noreferrer'>robota.ua</a>",
        "start": "11/2016",
        "end": "01/2021",
        "descr": "During my time here, I contributed to the largest job board in Ukraine, a 20-year-old flagship product. Upon joining, we transitioned from a monolithic setup (.NET, jQuery) to a modern microservices approach. This marked a crucial phase in my developer journey, focusing on redesign and tech updates. Technologies like Angular, GraphQL, and a Tailwind-based component design system brought the product up to industry standards.<br/><br/>Selecting Angular's second version, we swiftly developed a mobile SPA within a few months. Initially, our expertise in Angular/RxJS was limited, resulting in minor code smell and potential performance issues, like subscribe returning another subscription or forgetting to unsubscribe. Yet, with team growth, we proactively addressed these challenges. In a year, we made noticeable strides, incorporating advanced RxJS features (e.g., custom operators) for efficient reactive interfaces. We optimized with Zone.js and implemented comprehensive ESLint and TypeScript checks, underscoring our dedication to continuous improvement and staying current with evolving technologies.<br/>Beyond frontend work, I delved into serverless microservices (Lambda, NoSQL). Notably, during COVID-19, I developed a serverless microservice for ETA on public transport using a <a href='https://www.movable-type.co.uk/scripts/geohash.html' target='_blank' rel='noopener noreferrer'>GEOHASH</a> approach, reducing Google Maps API calls and costs without sacrificing accuracy.<br/><br/>What made this job rewarding was the sense of purpose in each solution. It wasn't just about the product; it was about assisting people in finding jobs and enhancing the user experience in every task. The creative work environment, along with collaboration among team members, fostered a positive workplace. Lasting connections were formed, and many of them remain friends to this day. It created an ideal environment for personal and professional growth. Starting as a middle developer, I progressed to Tech Lead, showcasing continuous learning and leadership opportunities here."
      },
      {
        "name": "Online course lecturer: <img class='company-logo' src='assets/images/itvdn-logo.png' /><a href='https://itvdn.com' target='_blank' rel='noopener noreferrer'>ITVDN.com</a> [part-time]",
        "start": "03/2017",
        "end": "07/2017",
        "descr": "Simultaneously with my main role, I dedicated time to contribute to the development of a React+Redux course on the ITVDN platform. This experience was both interesting and challenging, offering a valuable opportunity for professional growth. To learn more about this project, you can explore the content on <a href='https://itvdn.com/video/react_adv' target='_blank' rel='noopener noreferrer'>ITVDN</a> and <a href='https://www.youtube.com/playlist?list=PLvItDmb0sZw9CbcmbrRsdWSxPcr3qi4eZ' target='_blank' rel='noopener noreferrer'>YouTube (promo)</a>",
        "descr2": "In parallel with the main job (I mean part-time), I was involved with the development of the React+Redux course on ITVDN platform. As for me, it was a very interesting & challenging experience, but to repeat something like this I am not going to in the nearest future :) <br/> You can watch by the following link - <a href='https://itvdn.com/video/react_adv' target='_blank' rel='noopener noreferrer'>ITVDN</a> and <a href='https://www.youtube.com/playlist?list=PLvItDmb0sZw9CbcmbrRsdWSxPcr3qi4eZ' target='_blank' rel='noopener noreferrer'>YouTube (promo)</a>"
      },
      {
        "name": "Front-end engineer: Lazard Export",
        "start": "04/2016",
        "end": "09/2016",
        "descr": "During my time at Lazard Export, I served as a junior front-end developer for a groundbreaking IoT project focused on door access management via credit cards.<br/><br/>At that time, React and Angular were in their early stages, with Angular possibly still in beta. The absence of established tools posed challenges, but our decision to leverage React with Redux proved effective. My responsibilities encompassed not only developing the dashboard for managing access but also tackling crucial tasks such as setting up bundling with webpack, and integrating postcss.<br/><br/>Started as a junior with limited knowledge of frontend tools, I immersed myself in the challenges. Through hands-on experiences, I swiftly acquired expertise in frontend tools, culminating in a solid understanding by the end of my tenure."
      },
      {
        "name": "Front-end engineer: <img class='company-logo' src='assets/images/itcg-logo.jpg' />ITCG (Full-Service Digital Agency)",
        "start": "06/2015",
        "end": "04/2016",
        "descr": "During my initial professional experience, marking my transition from freelancing to formal employment, I undertook a role where the primary focus was developing diverse market landing pages.<br/><br/>Despite this being my primary focus, I often tackled unconventional requirements, employing advanced JavaScript techniques, such as effectively responding to changes in the height and position of the scroll within the iframe, or creating intricate parallax effects. One particularly memorable challenge involved manipulating the logic within an HTML+JS-generated advertising banner. I was tasked with introducing features like creating a pause at a specific interval or enabling reverse playback upon hover. This involved delving deep into the API documentation of a JS library, likely from Adobe, and overcoming such hurdles proved to be both stimulating and rewarding.<br/><br/>As my proficiency grew, I handled the full-stack development (backend+frontend) for a notable project — the Ukrainian version of Guerlain, a complex marketplace. By leveraging Django for the backend, I successfully brought the project to completion, constantly learning and evolving in the process."
      }
    ]
  }
}
