{
  "topbio": {
    "pic": "assets/images/avatar.jpg",
    "fullname": "Vlad Feninets",
    "title": "front-end engineer",
    "links": [
      {
        "name": "LinkedIn",
        "targetBlank": true,
        "href": "https://www.linkedin.com/in/fnnzzz/",
        "val": "https://linkedin.com/in/fnnzzz"
      },
      {
        "name": "GitHub",
        "targetBlank": true,
        "href": "https://github.com/fnnzzz/",
        "val": "https://github.com/fnnzzz"
      },
      {
        "name": "Email",
        "href": "mailto:v.feninets@gmail.com",
        "val": "v.feninets@gmail.com"
      },
      {
        "name": "Telegram",
        "targetBlank": true,
        "href": "https://telegram.me/vladddf8",
        "val": "@fnnzzz"
      }
    ]
  },
  "general-info": {
    "blockname": "General Info",
    "city": {
      "key": "🏙️",
      "val": "Vienna, Austria 🇦🇹"
    },
    "date-of-birth": { "key": "🎂", "val": "10 Nov 1994 🇺🇦" },
    "english": { "key": "🇬🇧", "val": "B2" },
    "education": {
      "key": "🎓",
      "val": "Computer engineering, bachelor degree [2012 - 2016]"
    }
  },
  "summary": {
    "blockname": "Summary",
    "paragraphs": [
      "As a Senior Front End Engineer with {{OVERALL_EXPERIENCE_YEARS}} years of diverse experience, I've overseen projects spanning a multitude of domains, from implementing serverless solutions using Lambda/Dynamo/SQS to configuring Linux servers for LAMP stacks.",
      "As a Frontend Tech Lead, I successfully tackled numerous technical challenges, adapting tools like Webpack and PostCSS to implement advanced performance optimizations. I implemented techniques such as TypeScript strict mode, introduced static analysis with Sonar, and integrated real-time error monitoring to minimize human errors. It allowed to enhance overall product quality.",
      "Additionally, I improved project builds, doubling their speed by introducing <a href='https://nx.dev/concepts/more-concepts/incremental-builds' target='_blank' rel='noopener noreferrer'>incremental builds</a> and transitioning our CI from Teamcity to GitHub Actions to allow parallelize the process. Simultaneously, I played a pivotal role in team growth, contributing to the expansion from 6 to 12 frontend engineers by actively participating in the hiring process as an interviewer.",
      "Continually broadening my skills as a T-Shaped engineer, I aim for roles like System Architect or CTO.<br/>In the past year, I've explored AWS Cloud, methodically expanding expertise and earning certifications (<a href='https://www.credly.com/badges/4986f3f5-3985-4467-9124-e18d26c59404/public_url' target='_blank' rel='noopener noreferrer'>#1</a>, <a href='https://www.credly.com/badges/6e1a5df7-bbae-46e6-952b-984757a5e337/public_url' target='_blank' rel='noopener noreferrer'>#2</a>). This empowers me to drive projects from inception to success, aligning with my passion for Smart Home. Cloud solutions simplify the automation of various aspects of my home most effectively, from practical tasks to own projects like real-time <a href='https://d1vlvmzdvhw8b.cloudfront.net/' target='_blank' rel='noopener noreferrer'>bus arrival cards</a>. I've also implemented microservices architectures for projects, contributing to their technological foundations."
    ]
  },
  "skills": {
    "blockname": "Skills",
    "list": [
      {
        "name": "Leadership skills",
        "descr": "The specifics can be found in the work experience section under Front End Tech Lead.<br/>Here, I'll provide a brief list:<br><br><ul class='inner-list'><li>🧑‍🏫 Mentoring engineers</li><li>📚 One-to-one sessions</li><li>🕵️‍♂️ Code review</li><li>🏗️ Architecture design sessions</li><li>🛠️ Troubleshooting and assistance</li><li>🎙️ Interviews (recruitment)</li><li>💰 Implemented a bonus system</li></ul>"
      },
      {
        "name": "Front-End. Languages, frameworks and tools",
        "descr": "<ul class='inner-list'><li>JavaScript/TypeScript<ul class='inner-list'><li>I understand intricacies like the differences between the <code>call</code> and <code>apply</code> methods, addressing potential pitfalls within <code>.sort()</code> in JavaScript.</li><li>I implement polyfills and innovative methods such as <code>.any()</code> for promises, enhancing the flexibility of asynchronous operations.</li><li>Familiar with the event loop, I have a keen interest in Functional Reactive Programming (FRP), contributing to a comprehensive understanding of asynchronous programming concepts.</li><li>I actively advocate for strictly typed code in Angular, ensuring improved reliability and maintainability of the codebase.</li><li>Proficient in TypeScript, I utilize features like generics, type guards, and conditional types to craft robust and type-safe code.</li><li>Applying advanced TypeScript techniques, including intricate type inference, I contribute to the development of innovative solutions that elevate code quality and functionality.</li></ul><li>RxJS<ul class='inner-list'><li>Mastery of RxJS, a mind-blowing tool for organizing asynchronous operations.</li><li>Proficient in distinguishing between <code>switchMap</code> and <code>mergeMap</code>, knowing when to leverage cold observables over hot ones, and understanding the benefits of using <code>shareReplay()</code>.</li></ul></li><li>Angular<ul class='inner-list'><li>Four years of experience with Angular, specializing in addressing performance issues and adept at managing <code>zone.js</code>.</li><li>In-depth knowledge of Angular's Dependency Injection/IoC, including the purpose of <code>@Inject</code> and <code>@SkipSelf</code>.</li><li>Successful implementation of custom modules using <code>forRoot(...)</code>.</li></ul></li><li>React<ul class='inner-list'><li>Currently my main framework, employing a simple stack with React and Redux.</li><li>Expertly utilizes RxJS for creating reactive forms, enhancing the dynamic nature of our application.</li><li>Implements SignalR with WebSockets to achieve real-time updates across various sections of our product, particularly crucial in the context of a trading platform with numerous dynamic components.</li><li>Authored an online course on advanced React and Redux techniques, available on the <a href='https://itvdn.com/video/react_adv' target='_blank' rel='noopener noreferrer'>ITVDN platform.</a></li></ul></li></li><li>HTML/CSS/SCSS/PostCSS<ul class='inner-list'><li>Proficient in various pre and post-processors, including SCSS and PostCSS, with experience in creating custom modules for PostCSS.</li><li>Absolutely like the whole utility-first approach, especially loving Tailwind CSS. It's like having a design Swiss Army knife!</li><li>Once upon a code review, I stumbled upon a true masterpiece: <code>div[style*=\"height: 70px\"] { height: 40px !important; }</code></li></ul></li></ul>"
      },
      {
        "name": "DevOps and Cloud",
        "descr": "<ul class='inner-list'><li>Embraced DevOps culture from my early industry days, setting up LAMP stacks for WordPress and configuring SMTP independently.</li><li>Once, I triumphed in a <a href='assets/images/k8s-certificate.png' target='_blank' rel='noopener noreferrer'>k8s hackathon</a>, but nowadays, while I frequently use Docker, Kubernetes has taken a back seat, though I retain a solid grasp of its core concepts.</li><li>Actively delved into AWS Cloud last year, systematically mastering its capabilities, and earned certifications (badges below). Currently preparing for more. Seeking a deeper understanding of security, networking and communication options in distributed systems, including messaging with SQS, SNS, and Kinesis.</li><li>Prior experience with various clouds and services (SaaS, PaaS), predominantly developer-centric, focusing on serverless with Lambda and NoSQL. Also, aiming for proficiency in describing infrastructure as code using tools like SAM, CDK, Terraform, and Pulumi.</li><li>Prior experience in designing and implementing a commercial solution on GCP. Developed a comprehensive ETA calculation system for public transport using <a href='https://www.movable-type.co.uk/scripts/geohash.html' target='_blank' rel='noopener noreferrer'>GEOHASH</a> with Functions + Datastore. Successfully led the project from inception to production, achieving a notable reduction in Google Maps API queries while ensuring cost-effectiveness and optimal quality.</li><li>Regularly leverage AWS Cloud with Lambda + NoSQL for personal projects, bots, and Smart Home integrations. An <a href='https://d1vlvmzdvhw8b.cloudfront.net/' target='_blank' rel='noopener noreferrer'>example</a> includes a real-time public transport arrival card near my house.</li><li>Proficient in CI/CD setups. Migrated from TeamCity to Github Actions for accelerated builds (commerical experience). Also configured builds for numerous pet-projects on Bitbucket and Circle CI.</li></ul>",
        "badges": [
          { "pic": "assets/images/cpf-badge.png", "url": "https://www.credly.com/badges/99489466-96d8-4dbc-9bab-a152d48aa692/public_url" },
          { "pic": "assets/images/developer-associate.png", "url": "https://www.credly.com/badges/4986f3f5-3985-4467-9124-e18d26c59404/public_url" },
          { "pic": "assets/images/solutions-arch-associate.png" }
        ]
      },
      {
        "name": "Miscellaneous",
        "descr": "<ul class='inner-list'><li>Node.js:<ul class='inner-list'><li>Efficiently utilized in personal projects.</li><li>Developed REST APIs using Express/Koa for various pet projects.</li><li>Provided support for a SSR app for Angular, implementing different optimizations.</li><li>Frequently delved into the internals of various libraries and tools within node_modules.</li></ul></li><li>GraphQL with Apollo:<ul class='inner-list'><li>Utilized as the primary data source on robota.ua.</li><li>Developed resolvers in JavaScript for various scenarios.</li></ul></li><li>SQL:<ul class='inner-list'><li>During my student years, extensively used for creating custom dashboards on PHP and similar projects.</li><li>Currently, SQL usage is infrequent, and queries are relatively simple, often leveraging services like S3 Select or Athena.</li></ul></li><li>NoSQL:<ul class='inner-list'><li>Regularly use DynamoDB for personal projects and have experience with MongoDB.</li></ul></li><li>Python:<ul class='inner-list'><li>Occasionally write simple tools for unix, leveraging Python as an 'advanced bash' alternative.</li></ul></li></ul>"
      }
    ]
  },
  "work-experience": {
    "blockname": "Work Experience",
    "list": [
      {
        "name": "Senior Front-end engineer: <img class='company-logo' src='assets/images/xbo-logo.webp' /><a href='https://xbo.com/web-trader' target='_blank' rel='noopener noreferrer'>xbo.com</a>",
        "start": "04/2022",
        "descr": "Contributed to the development of XBO.com's crypto-trading platform.<br/>It significantly enriched my understanding of the crypto world and trading in its entirety.<br/><br/>The product demanded extensive real-time updates through websockets for the majority of its features, requiring updates every second for charts, trends, and more. This led to dealing with various performance intricacies, prompting optimization efforts. Additionally, the platform involved the integration of complex reactive forms with calculations and mathematics on the front end. We also encountered and solved precision issues with floating-point numbers in JavaScript, a crucial consideration for maintaining accuracy in financial data.<br/><br/>The development stack used for this solution was quite simple and popular:<br/>React, Redux, SignalR and a little bit of RxJS."
      },
      {
        "name": "Front-end + DevOps engineer: <img class='company-logo' src='assets/images/ducky-logo.jpg' />ducky.app",
        "start": "12/2021",
        "end": "04/2022",
        "descr": "Drove frontend development of Ducky.app, a groundbreaking startup dedicated to streamlining benefits management for companies and reducing costs through an innovative concept known as the \"Benefits Cafeteria\".<br/><br/>I collaborated with an exceptional team of experts, where each member was a rock star, showcasing strong soft skills and a high level of tech expertise. Despite our small size (10 members), we excelled in asynchronous communication and maintained well-defined processes, cultivating a productive work atmosphere.<br/><br/>Taking the lead in front-end development independently, my focus was on the rapid creation of the product, essential for a startup's pace, while ensuring a future-proof architecture. Additionally, I played a role in the DevOps domain, assisting with tasks like CI/CD and automating processes. We opted for Angular paired with Tailwind (as a design system). This deliberate choice in our technology stack accelerated the development pace.<br/><br/>Regrettably, despite our efforts, the product could not be delivered to customers due to financial issues. But overall, it was an exceptional experience with good teamwork vibes and efficient processes. The development journey was truly enjoyable."
      },
      {
        "name": "Front-end Tech Lead: <img class='company-logo' src='assets/images/robota-logo.png' /><a href='https://robota.ua' target='_blank' rel='noopener noreferrer'>robota.ua</a>",
        "start": "01/2021",
        "end": "12/2021",
        "descr": "During my 4-year tenure at robota.ua, I progressed to the role of Front-End Tech Lead, an unparalleled experience. I actively participated in interviews and contributed to expanding the frontend team from 6 to 12 developers. Beyond technical challenges, I engaged in people management, assisting with problem resolution and architecting new features.<br/>I implemented a rewards and bonus system, enhancing motivation and addressing issues in processes like code reviews. On the technical front, I conducted research to address global issues reported by developers, product owners, or users. Some examples include:<ul><br/><li><b>Problem:</b> The production occasionally experienced app crashes, hindering seamless user interaction. Some errors were human oversight, not easily detectable during code reviews or testing.<br/><b>Solution:</b> Implemented a strategic shift to TypeScript strict mode, compelling developers to include additional checks, significantly reducing the occurrence of errors. Expanded ESLint checks with various plugins to catch potential issues. Integrated SonarQube for syntax analysis, highlighting common code smells and security problems in pull requests. The addition of Sentry enabled precise tracking of client-side errors, pinpointing the responsible developer for automatic assignment and swift resolution.</li></br><li><b>Problem:</b> CI delays and queues due to a large team and monorepo.<br/><b>Solution:</b> Proposed a transition from TeamCity to GitHub Actions, providing a possibility to scale a number of build-agents compared to TeamCity. Introduced caching for built libraries and <a target='_blank' rel='noopener noreferrer' href='https://nx.dev/concepts/more-concepts/incremental-builds'>incremental builds</a> to optimize build times. This comprehensive approach reduced average build times from ~40 to ~20 minutes and completely eliminated queue problems by dynamically scaling agents.<br/><br/><li><b>Problem:</b> Poor web vitals affecting UX and SEO.<br/><b>Solution:</b> Initially, leveraged Cloudflare optimizations to enhance overall performance. Focused on optimizing static content with caching strategies, preloading/precaching, and more. Investigated code-related issues and identified tools like <a href='https://www.rx-angular.io/' target='_blank' rel='noopener noreferrer'>RxAngular</a> to significantly reduce \"zone.js\" impact on performance. Resulted in transitioning some pages from red to yellow-green zones, substantially improving web vitals metrics such as loading speed, first contentful paint, and smoothness.</li></br><li><b>Problem:</b> Developers sought a more streamlined DX for routine tasks like library generation and GraphQL schema regeneration.<br/><b>Solution:</b> Introduced a variety of node tools that operate in interactive modes with prompts and autocompletion. This empowered developers to execute routine tasks effortlessly without the need to memorize complex commands. This approach significantly improved efficiency and made mundane tasks straightforward.</li></ul><br/>In summary, my technical role involved extensive R&D to tackle global challenges. This experience was fantastic, and I thrive in environments that demand experimentation and problem-solving. It was a great opportunity to enhance my leadership skills."
      },
      {
        "name": "Front-end engineer: <img class='company-logo' src='assets/images/robota-logo.png' /><a href='https://robota.ua' target='_blank' rel='noopener noreferrer'>robota.ua</a>",
        "start": "11/2016",
        "end": "01/2021",
        "descr": "During my time here, I contributed to the largest job board in Ukraine, a 20-year-old flagship product. Upon joining, we transitioned from a monolithic setup (.NET, jQuery) to a modern microservices approach. This marked a crucial phase in my developer journey, focusing on redesign and tech updates. Technologies like Angular, GraphQL, and a Tailwind-based component design system brought the product up to industry standards.<br/><br/>Selecting Angular's second version, we swiftly developed a mobile SPA within a few months. Initially, our expertise in Angular/RxJS was limited, resulting in minor code smell and potential performance issues, like subscribe returning another subscription or forgetting to unsubscribe. Yet, with team growth, we proactively addressed these challenges. In a year, we made noticeable strides, incorporating advanced RxJS features (e.g., custom operators) for efficient reactive interfaces. We optimized with Zone.js and implemented comprehensive ESLint and TypeScript checks, underscoring our dedication to continuous improvement and staying current with evolving technologies.<br/>Beyond frontend work, I delved into serverless microservices (Lambda, NoSQL). Notably, during COVID-19, I developed a serverless microservice for ETA on public transport using a <a href='https://www.movable-type.co.uk/scripts/geohash.html' target='_blank' rel='noopener noreferrer'>GEOHASH</a> approach, reducing Google Maps API calls and costs without sacrificing accuracy.<br/><br/>What made this job rewarding was the sense of purpose in each solution. It wasn't just about the product; it was about assisting people in finding jobs and enhancing the user experience in every task. The creative work environment, along with collaboration among team members, fostered a positive workplace. Lasting connections were formed, and many of them remain friends to this day. It created an ideal environment for personal and professional growth. Starting as a middle developer, I progressed to Tech Lead, showcasing continuous learning and leadership opportunities here."
      },
      {
        "name": "Online course lecturer: <img class='company-logo' src='assets/images/itvdn-logo.png' /><a href='https://itvdn.com' target='_blank' rel='noopener noreferrer'>ITVDN.com</a> [part-time]",
        "start": "03/2017",
        "end": "07/2017",
        "descr": "Simultaneously with my main role, I dedicated time to contribute to the development of a React+Redux course on the ITVDN platform. This experience was both interesting and challenging, offering a valuable opportunity for professional growth. To learn more about this project, you can explore the content on <a href='https://itvdn.com/video/react_adv' target='_blank' rel='noopener noreferrer'>ITVDN</a> and <a href='https://www.youtube.com/playlist?list=PLvItDmb0sZw9CbcmbrRsdWSxPcr3qi4eZ' target='_blank' rel='noopener noreferrer'>YouTube (promo)</a>",
        "descr2": "In parallel with the main job (I mean part-time), I was involved with the development of the React+Redux course on ITVDN platform. As for me, it was a very interesting & challenging experience, but to repeat something like this I am not going to in the nearest future :) <br/> You can watch by the following link - <a href='https://itvdn.com/video/react_adv' target='_blank' rel='noopener noreferrer'>ITVDN</a> and <a href='https://www.youtube.com/playlist?list=PLvItDmb0sZw9CbcmbrRsdWSxPcr3qi4eZ' target='_blank' rel='noopener noreferrer'>YouTube (promo)</a>"
      },
      {
        "name": "Front-end engineer: Lazard Export",
        "start": "04/2016",
        "end": "09/2016",
        "descr": "During my time at Lazard Export, I served as a junior front-end developer for a groundbreaking IoT project focused on door access management via credit cards.<br/><br/>At that time, React and Angular were in their early stages, with Angular possibly still in beta. The absence of established tools posed challenges, but our decision to leverage React with Redux proved effective. My responsibilities encompassed not only developing the dashboard for managing access but also tackling crucial tasks such as setting up bundling with webpack, and integrating postcss.<br/><br/>Started as a junior with limited knowledge of frontend tools, I immersed myself in the challenges. Through hands-on experiences, I swiftly acquired expertise in frontend tools, culminating in a solid understanding by the end of my tenure."
      },
      {
        "name": "Front-end engineer: <img class='company-logo' src='assets/images/itcg-logo.jpg' />ITCG (Full-Service Digital Agency)",
        "start": "06/2015",
        "end": "04/2016",
        "descr": "During my initial professional experience, marking my transition from freelancing to formal employment, I undertook a role where the primary focus was developing diverse market landing pages.<br/><br/>Despite this being my primary focus, I often tackled unconventional requirements, employing advanced JavaScript techniques, such as effectively responding to changes in the height and position of the scroll within the iframe, or creating intricate parallax effects. One particularly memorable challenge involved manipulating the logic within an HTML+JS-generated advertising banner. I was tasked with introducing features like creating a pause at a specific interval or enabling reverse playback upon hover. This involved delving deep into the API documentation of a JS library, likely from Adobe, and overcoming such hurdles proved to be both stimulating and rewarding.<br/><br/>As my proficiency grew, I handled the full-stack development (backend+frontend) for a notable project — the Ukrainian version of Guerlain, a complex marketplace. By leveraging Django for the backend, I successfully brought the project to completion, constantly learning and evolving in the process."
      }
    ]
  }
}
