{ 
  "topbio": {
    "pic": "assets/images/avatar.jpg",
    "fullname": "Vlad Feninets",
    "title": "front-end engineer",
    "links": [
      { "name": "LinkedIn", "targetBlank": true, "href": "https://www.linkedin.com/in/fnnzzz/", "val": "https://linkedin.com/in/fnnzzz" },
      { "name": "GitHub", "targetBlank": true, "href": "https://github.com/fnnzzz/", "val": "https://github.com/fnnzzz" },
      { "name": "Email", "href": "mailto:v.feninets@gmail.com", "val": "v.feninets@gmail.com" },
      { "name": "Telegram", "targetBlank": true, "href": "https://telegram.me/fnnzzz", "val": "@fnnzzz" }
    ]
  },
  "general-info": {
    "blockname": "General Info",
    "date-of-birth": { "key": "Date of birth", "val": "10 Nov 1994" },
    "education": {
      "key": "Education",
      "val": "[09.2012 — 06.2016] Donbas State Technical University (computer engineer, bachelor degree)"
    }
  },
  "skills": {
    "blockname": "Skills",
    "list": [
      { 
        "name": "Javascript [ESnext]",
        "descr": "I know difference between `apply` and `call`<br/>I know why `typeof [] === \"object\"`,<br/>how works event loop, and how to avoid mutation of a data in JS"
      },
      { "name": "Typescript",
        "descr": "Using angular for several years I became a fan of a strictly typed code, I can use the generics and I know advanced tricks like type guards / inferring types / conditional types and <a href=\"https://youtu.be/ROxTGcqj01I?t=4024\">etc</a>"
      },
      {
        "name": "RxJS",
        "descr": "The best way to organize asynchronous things<br/>I know a difference between switchMap and mergeMap and cold observable vs hot observable"
      },
      {
        "name": "Angular 13"
      },
      { "name": "HTML5 + CSS3 + SVG" },
      { "name": "Git" },
      { "name": "Linux",
        "descr": "I know how to use grep, I can write a simple bash-script, I can monitore instance via top/htop"
      },
      {
        "name": "node.js",
        "descr": "Often use for an automation some things with files, utility purposes or some global refactoring (<a href='https://github.com/dsherret/ts-morph' target='_blank'>ts-morph</a>), I have experience with koa+mongoose in own pet-project"
      },
      {
        "name": "SASS/tailwindcss"
      },
      {
        "name": "Jade/Pug/Mustache/Handlebars"
      },
      {
        "name": "Docker",
        "descr": "Often use, both for work and personal purposes"
      },
      {
        "name": "k8s",
        "descr": "I know general concepts, but rarely used in practice."
      },
      {
        "name": "CI/CD",
        "descr": "I worked with teamcity, independently set up a complex CI/CD at robota.ua for build a large monorepo with cache, incremental build etc"
      },
      {
        "name": "MySQL",
        "descr": "I have experience in websites development with individual structure of relational DB. Please find my diploma work by the following link: <a href='http://diplom-feninets.esy.es/index.php/requests' target='_blank'>http://diplom-feninets.esy.es/index.php/requests</a> All the DB is organized via relational connections. You can find the presentation to my diploma work by the following link: <a href='https://fnnzzz.github.io/diploma-presentation/' target='_blank'>https://fnnzzz.github.io/diploma-presentation/</a>"
      },
      {
        "name": "NoSQL",
        "descr": "I tried to use Elastic/MongoDB for pet-projects"
      },
      {
        "name": "PHP",
        "descr": "I had experience on websites development on native PHP, using different MVC frameworks (ex. Codelgniter), on WordPress etc."
      },
      {
        "name": "Python",
        "descr": "I often write simple scripts in Python. Also, I wrote several websites in Django. You can find one of them by the following link, I did front-end as well as back-end: <a href='http://guerlain.ua/'>http://guerlain.ua/</a>"
      },
      {
        "name": "C#",
        "descr": "During second & third years of studying at the university I was writing many desktop (WPF) and console apps"
      },
      {
        "name": "Java",
        "descr": "I have developed one desktop app & 2 apps for Android."
      }
    ]
  },
  "work-experience": {
    "blockname": "Work Experience",
    "list": [
      {
        "name": "ducky app",
        "start": "02/2022"
      },
      {
        "name": "robota.ua: front-end tech lead",
        "start": "01/2021",
        "end": "02/2022",
        "descr": "In this role I focused on complex problems, for example:<br><br>– slow builds: I implemented a non-trivial cache system for CI/CD on github actions, updated our stack to modern and fast webpack5, implemented some tricks for speed-up in dependencies via <a href='https://www.npmjs.com/package/patch-package'>patch-package</a><br>– improved performance (core web-vitals: LCP, TTFB, FID)<br/>– improved developer experience for engineers, for example: some routine things, like generate code from schema, become easier<br/>– implemented typesript's strict mode, spellcheckers and a lot of linters to avoid mistakes of human nature.<br><br>Besides technical things I did a mentoring, recruitment and various events to create a good atmosphere in the direction of the front-end (for example I implemented a bonus system based on code review and assistance to other)"
      },
      {
        "name": "robota.ua: front-end engineer in a jobseeker team",
        "start": "11/2016",
        "end": "01/2021",
        "descr": "Worked in jobseeker-team. During this time I managed to develop using different frameworks and approaches: knockout, react+redux, angular. Last years robota.ua finally settled on the choice: angular + graphql and we increased our expertise in this direction"
      },
      {
        "name": "ITVDN [part-time]",
        "start": "03/2017",
        "end": "07/2017",
        "descr": "In parallel with the main job (I mean part-time) I was involved with the React+Redux courses development on ITVDN platform. As for me, it was very interesting & challenging experience, but to repeat something like this I am not going to in the nearest future :) <br/> You can watch by the following link - <a href='https://itvdn.com/ru/video/react_adv' target='_blank'>ITVDN</a> and <a href='https://www.youtube.com/playlist?list=PLvItDmb0sZw9CbcmbrRsdWSxPcr3qi4eZ' target='_blank'>YouTube (promo cropped video)</a>"
      },
      {
        "name": "pickoose.com",
        "start": "09/2016",
        "end": "11/2016",
        "descr": "Startup, I had come there to re-develop the existing front-end from angular v1 to React + Redux + Restful eco-system. I got interesting experience that was connected with the internal messenger development during almost 2 months. It was fun with debounce/throttling for mark viewed messages, keep unsent messages in LocalStorage etc. Unfortunatelly, startup did not receive investments in 2 months & that is why I had to look for a new job."
      },
      {
        "name": "Lazard Export",
        "start": "04/2016",
        "end": "09/2016",
        "descr": "Here I had come <s>to God</s> to Webpack + React + Redux. I had develoved dashboard to IoT project with the help of which the control had been monitored (device was on raspberry pi, leaded with the help of RESTful)"
      },
      {
        "name": "ITCG",
        "start": "06/2015",
        "end": "04/2016",
        "descr": "Development of promo and langing pages. Mostly they were vanilla JS & a lot of jQuery-spagetti. Althought had to be fullstack & implemented the whole project from ground zero (back-end + front-end). Back-end, by the way, was implemented in Python (django). On top of all that, this project is still in production: <a href='#'>http://guerlain.ua/</a>"
      },
      {
        "name": "Freelance",
        "start": "2014",
        "end": "2015",
        "descr": "We had two bags of wordpress, seventy-five pellets of free html5 templates... <br /> Not that we needed all that for the freelance, but once you get locked into a serious web-sites collection, the tendency is to push it as far as you can ©"
      }
    ]
  }
}
